cangalaya/control-aforo-esp8266/src/main.cpp
  // A - A - A - A - A - A - A - A - A - A - A - A - A - A - A - A - A - A -
  // A - A - A - A - A - A - A - A - A - A - A - A - A - A - A - A - A - A -
  // ASIGNANDO "A" SENSOR 1
  if (digitalRead(Sensor_1) == LOW && A == "X")
  {
    A = "1E";
  }
  // ASIGNANDO "A" SENSOR 2
  if (digitalRead(Sensor_2) == LOW && A == "X")
  {
    A = "2E";
  }

  // LIBERANDO "A" SENSOR 1
  if (digitalRead(Sensor_1) == HIGH && A == "1E" && B == "X" && C == "X" && D == "X")
  {
    A = "X";
  }

  // LIBERANDO "A" SENSOR 2
  if (digitalRead(Sensor_2) == HIGH && A == "2E" && B == "X" && C == "X" && D == "X")
  {
    A = "X";
  }
  // B - B - B - B - B - B - B - B - B - B - B - B - B - B - B - B - B - B -
  // B - B - B - B - B - B - B - B - B - B - B - B - B - B - B - B - B - B -
  // ASIGNANDO "B" SENSOR 1
  if (digitalRead(Sensor_1) == LOW && A == "2E")
  {
    B = "1E";
  }
  // ASIGNANDO "B" SENSOR 2
  if (digitalRead(Sensor_2) == LOW && A == "1E")
  {
    B = "2E";
  }

  // LIBERANDO "B" SENSOR 1
  if (digitalRead(Sensor_1) == HIGH && A == "2E" && B == "1E" && C == "X" && D == "X")
  {
    B = "X";
  }

  // LIBERANDO "B" SENSOR 2
  if (digitalRead(Sensor_2) == HIGH && A == "1E" && B == "2E" && C == "X" && D == "X")
  {
    B = "X";
  }
  // C - C - C - C - C - C - C - C - C - C - C - C - C - C - C - C - C - C -
  // C - C - C - C - C - C - C - C - C - C - C - C - C - C - C - C - C - C -
  // ASIGNANDO "C" SENSOR 1
  if (digitalRead(Sensor_1) == HIGH && A == "1E" && B == "2E")
  {
    C = "1S";
  }
  // ASIGNANDO "C" SENSOR 2
  if (digitalRead(Sensor_2) == HIGH && A == "2E" && B == "1E")
  {
    C = "2S";
  }

  // LIBERANDO "C" SENSOR 1
  if (digitalRead(Sensor_1) == LOW && A == "1E" && B == "2E" && C == "1S" && D == "X")
  {
    C = "X";
  }

  // LIBERANDO "C" SENSOR 2
  if (digitalRead(Sensor_2) == LOW && A == "2E" && B == "1E" && C == "2S" && D == "X")
  {
    C = "X";
  }

  // D - D - D - D - D - D - D - D - D - D - D - D - D - D - D - D - D - D -
  // D - D - D - D - D - D - D - D - D - D - D - D - D - D - D - D - D - D -

  // ASIGNANDO "D" SENSOR 1
  if (digitalRead(Sensor_1) == HIGH && A == "2E" && B == "1E" && C == "2S")
  {
    D = "1S";
  }
  // ASIGNANDO "D" SENSOR 2
  if (digitalRead(Sensor_2) == HIGH && A == "1E" && B == "2E" && C == "1S")
  {
    D = "2S";
  }

  if (readStringFromEEPROM(200) == String("low"))
  {
    //////////////////////// LOW //////////////////////////////77
    // Serial.println("low");
    if (digitalRead(Sensor_2) == HIGH && A == "1E" && B == "2E")
    { // && B == "2E" C == "1S" && D == "2S"

      // FILTRO POR TIEMPO DE PULSO (TIEMPO SENSOR 1, TIEMPO SENSOR 2, AL MISMO TIEMPO
      if (Last_Sensor1_Time >= Sensor1_Min_Time && Last_Sensor2_Time >= Sensor2_Min_Time && Last_Same_Time >= Sametime_Min_Time)
      {

        // Serial.println ("ENTRÓ");

        // Serial.println ("PERSONA ENTRANDO");
        // Realiza la acción deseada

        // cli(); //Deshabilitar interrupciones
        ingreso++;
        total++;
        cambio_pantalla = 1;
      }
      else
      {
        Serial.println("CONTEO DE ENTRADA POR RUIDO, NO VÁLIDO");

        // Imp_Conteo_Ultimos_Tiempos();
      }

      A = "X";
      B = "X";
      C = "X";
      D = "X";
    }

    if (digitalRead(Sensor_1) == HIGH && A == "2E" && B == "1E")
    { //&& B == "1E" && C == "2S" && D == "1S"

      // FILTRO POR TIEMPO DE PULSO (TIEMPO SENSOR 1, TIEMPO SENSOR 2, AL MISMO TIEMPO
      if (Last_Sensor1_Time >= Sensor1_Min_Time && Last_Sensor2_Time >= Sensor2_Min_Time && Last_Same_Time >= Sametime_Min_Time)
      {

        // Serial.println ("SALIÓ");

        // Serial.println ("PERSONA SALIENDO");
        // cli(); //Deshabilitar interrupciones
        egreso++;
        total--;
        cambio_pantalla = 1;

        // if (total < 0)
        //    {
        //     total = 0;
        //     egreso--;
        //    }
      }
      else
      {
        Serial.println("CONTEO DE SALIDA POR RUIDO, NO VÁLIDO");

        // IMPRESION DE ULTIMO TIEMPO REGISTRADO
        // Imp_Conteo_Ultimos_Tiempos();
      }

      A = "X";
      B = "X";
      C = "X";
      D = "X";
    }
  }
  else if (readStringFromEEPROM(200) == String("medium"))
  {
    //////////////////////// MEDIUM //////////////////////////////77
    // Serial.println("meduim");
    if (digitalRead(Sensor_2) == HIGH && A == "1E" && B == "2E" && C == "1S")
    { // && B == "2E" C == "1S" && D == "2S"

      // FILTRO POR TIEMPO DE PULSO (TIEMPO SENSOR 1, TIEMPO SENSOR 2, AL MISMO TIEMPO
      if (Last_Sensor1_Time >= Sensor1_Min_Time && Last_Sensor2_Time >= Sensor2_Min_Time && Last_Same_Time >= Sametime_Min_Time)
      {

        // Serial.println ("ENTRÓ");

        // Serial.println ("PERSONA ENTRANDO");
        // Realiza la acción deseada

        // cli(); //Deshabilitar interrupciones
        ingreso++;
        total++;
        cambio_pantalla = 1;
      }
      else
      {
        Serial.println("CONTEO DE ENTRADA POR RUIDO, NO VÁLIDO");

        // Imp_Conteo_Ultimos_Tiempos();
      }

      A = "X";
      B = "X";
      C = "X";
      D = "X";
    }

    if (digitalRead(Sensor_1) == HIGH && A == "2E" && B == "1E" && C == "2S")
    { //&& B == "1E" && C == "2S" && D == "1S"

      // FILTRO POR TIEMPO DE PULSO (TIEMPO SENSOR 1, TIEMPO SENSOR 2, AL MISMO TIEMPO
      if (Last_Sensor1_Time >= Sensor1_Min_Time && Last_Sensor2_Time >= Sensor2_Min_Time && Last_Same_Time >= Sametime_Min_Time)
      {

        // Serial.println ("SALIÓ");

        // Serial.println ("PERSONA SALIENDO");
        // cli(); //Deshabilitar interrupciones
        egreso++;
        total--;
        cambio_pantalla = 1;

        // if (total < 0)
        //    {
        //     total = 0;
        //     egreso--;
        //    }
      }
      else
      {
        Serial.println("CONTEO DE SALIDA POR RUIDO, NO VÁLIDO");

        // IMPRESION DE ULTIMO TIEMPO REGISTRADO
        // Imp_Conteo_Ultimos_Tiempos();
      }

      A = "X";
      B = "X";
      C = "X";
      D = "X";
    }
  }
  else
  {
    //////////////////////// HIGH //////////////////////////////77
    // Serial.println("high");
    if (digitalRead(Sensor_2) == HIGH && A == "1E" && B == "2E" && C == "1S" && D == "2S")
    { // && B == "2E" C == "1S" && D == "2S"

      // FILTRO POR TIEMPO DE PULSO (TIEMPO SENSOR 1, TIEMPO SENSOR 2, AL MISMO TIEMPO
      if (Last_Sensor1_Time >= Sensor1_Min_Time && Last_Sensor2_Time >= Sensor2_Min_Time && Last_Same_Time >= Sametime_Min_Time)
      {

