cangalaya/control-aforo-esp8266/src/main.cpp
        // Serial.println ("ENTRÓ");

        // Serial.println ("PERSONA ENTRANDO");
        // Realiza la acción deseada

        // cli(); //Deshabilitar interrupciones
        ingreso++;
        total++;
        cambio_pantalla = 1;
      }
      else
      {
        Serial.println("CONTEO DE ENTRADA POR RUIDO, NO VÁLIDO");

        // Imp_Conteo_Ultimos_Tiempos();
      }

      A = "X";
      B = "X";
      C = "X";
      D = "X";
    }

    if (digitalRead(Sensor_1) == HIGH && A == "2E" && B == "1E" && C == "2S" && D == "1S")
    { //&& B == "1E" && C == "2S" && D == "1S"

      // FILTRO POR TIEMPO DE PULSO (TIEMPO SENSOR 1, TIEMPO SENSOR 2, AL MISMO TIEMPO
      if (Last_Sensor1_Time >= Sensor1_Min_Time && Last_Sensor2_Time >= Sensor2_Min_Time && Last_Same_Time >= Sametime_Min_Time)
      {

        // Serial.println ("SALIÓ");

        // Serial.println ("PERSONA SALIENDO");
        // cli(); //Deshabilitar interrupciones
        egreso++;
        total--;
        cambio_pantalla = 1;

        // if (total < 0)
        //    {
        //     total = 0;
        //     egreso--;
        //    }
      }
      else
      {
        Serial.println("CONTEO DE SALIDA POR RUIDO, NO VÁLIDO");

        // IMPRESION DE ULTIMO TIEMPO REGISTRADO
        // Imp_Conteo_Ultimos_Tiempos();
      }

      A = "X";
      B = "X";
      C = "X";
      D = "X";
    }
  }

  if (last_value != total)
  {
    if (last_value < total)
    {
      // si la persona entro
      //     {
      Serial.print("entro | "); // entro
      BDatos.total++;           // seteamos los valores locales
      BDatos.ingresos++;
      if (BDatos.total > BDatos.aforo)
        BDatos.excesos++;
      Serial.println("Aforo: " + String(BDatos.aforo) + "  Total: " + String(BDatos.total)); // entro
      // SendUDP_Packet(String() + BDatos.estado_inicial + '|' + BDatos.aforo + '|' + BDatos.total + '|' + BDatos.ingresos + '|' + BDatos.egresos);    // el elemento separador es el |
      flag_send_data = 1; // enviamos la data actualizada
      // actualizar_pantalla();                                                                    // actualizamos pantalla con nuevos valores
      counter_minutos_inactividad = 0; // reset a minutos de inactividad
      counter_millis = 0;              // reseteamos el counter_millis para anular el reseteo por inacctividad
    }
    else
    {
      Serial.print("salio | ");  // salio
      if (BDatos.total - 1 >= 0) // protección para que no adopte valores negativos
      {
        BDatos.total--;
        BDatos.egresos++;
        // SendUDP_Packet(String() + BDatos.estado_inicial + '|' + BDatos.aforo + '|' + BDatos.total + '|' + BDatos.ingresos + '|' + BDatos.egresos);
        flag_send_data = 1; // enviamos la data actualizada
        // actualizar_pantalla();
        counter_minutos_inactividad = 0;                                                     // reset a minutos de inactividad
        counter_millis = 0;                                                                  // reseteamos el counter_millis para anular el reseteo por inacctividad
      }                                                                                      // actualizamos pantalla con nuevos valores
      Serial.println("Aforo: " + String(BDatos.aforo) + "  Total: " + String(BDatos.total)); // entro
    }
    last_value = total;
    cambio_pantalla = 1;
  }

  if (cambio_pantalla == 1 && digitalRead(Sensor_1) == HIGH && digitalRead(Sensor_2) == HIGH)
  {
    // Pantalla();
    cambio_pantalla = 0;

    // IMPRESION DE ULTIMO TIEMPO REGISTRADO
    // Imp_Conteo_Ultimos_Tiempos();
  }
}

//===============================================================================================================================================
//===============================================================================================================================================
// CLOCK ROUTINES

// NTP Servers:
static const char ntpServerName[] = "south-america.pool.ntp.org";

const int timeZone = -5; // Perú

const int NTP_PACKET_SIZE = 48; // NTP time is in the first 48 bytes of message
// byte packetBuffer[NTP_PACKET_SIZE]; //buffer to hold incoming & outgoing packets

time_t getNtpTime();
void sendNTPpacket(IPAddress &address);

// REINICIO DE CUENTA
bool reinicioCuenta = true;
void reinicio_de_cuenta()
{
  if (hour() == hora_reinicio && minute() == minuto_reinicio && second() == 0 && reinicioCuenta)
  {
    Serial.print("Reinicio de Cuenta ------ día nuevo\n");
    BDatos.total = 0;
    BDatos.ingresos = 0;
    BDatos.egresos = 0;
    BDatos.excesos = 0;
    reinicioCuenta = false;
  }
  if (minute() != minuto_reinicio)
    reinicioCuenta = true;
}
unsigned long int PrevMillis = 0;
void envioDataRealtime()
{
  if (millis() < 2000)
    PrevMillis = 0; // protección frente a desborde de millis
  if ((Firebase.ready() && (millis() - PrevMillis > (readStringFromEEPROM(240).toInt() * 1000))) && (counter_millis > 5000))
  {
    Serial.println(">>> Enviando datos RealTime >>>");
    PrevMillis = millis();
    //   int integer = 0;
    //   Firebase.RTDB.getInt(&fbdo, "/tasa/callao/bano-varones/config/aforo") ? integer = fbdo.to<int>() : Serial.print(fbdo.errorReason().c_str());
    //   Serial.println(integer);
    //  FirebaseJson jVal;
    //  Serial.printf("Get json ref... %s\n", Firebase.RTDB.getJSON(&fbdo, "/tasa/callao/bano-varones/config", &jVal) ? jVal.raw() : fbdo.errorReason().c_str());
    jsonData.clear();
    jsonData.set("total", BDatos.total);
    jsonData.set("ingresos", BDatos.ingresos);
    jsonData.set("egresos", BDatos.egresos);
    jsonData.set("excesos", BDatos.excesos);
    Serial.printf("Update json... %s\n\n", Firebase.RTDB.updateNodeAsync(&fbdo, path_data + fbdo.pushName(), &jsonData) ? "ok" : fbdo.errorReason().c_str());

    // int aforo_realtime = 0;
    // if (Firebase.RTDB.getInt(&fbdo, F("/tasa/callao/bano-varones/config/aforo/int")))
    // {
    //   aforo_realtime = (fbdo.to<int>());
    //   Serial.println("Aforo realtime = " + String(aforo_realtime));
    // }
    // else
    // {
    //   Serial.println(fbdo.errorReason().c_str());
    // }
  }
}

time_t getNtpTime()
{
  IPAddress ntpServerIP; // NTP server's ip address

