cangalaya/control-aforo-esp8266/src/main.cpp
  while (UDP.parsePacket() > 0)
    ; // discard any previously received packets
  Serial.println("Transmit NTP Request");
  // get a random server from the pool
  WiFi.hostByName(ntpServerName, ntpServerIP);
  Serial.print(ntpServerName);
  Serial.print(": ");
  Serial.println(ntpServerIP);
  sendNTPpacket(ntpServerIP);
  uint32_t beginWait = millis();
  while (millis() - beginWait < 1500)
  {
    int size = UDP.parsePacket();
    if (size >= NTP_PACKET_SIZE)
    {
      Serial.println("Receive NTP Response");
      UDP.read(packetBuffer, NTP_PACKET_SIZE); // read packet into the buffer
      unsigned long secsSince1900;
      // convert four bytes starting at location 40 to a long integer
      secsSince1900 = (unsigned long)packetBuffer[40] << 24;
      secsSince1900 |= (unsigned long)packetBuffer[41] << 16;
      secsSince1900 |= (unsigned long)packetBuffer[42] << 8;
      secsSince1900 |= (unsigned long)packetBuffer[43];
      return secsSince1900 - 2208988800UL + timeZone * SECS_PER_HOUR;
    }
  }
  Serial.println("No NTP Response :-(");
  return 0; // return 0 if unable to get the time
}

// send an NTP request to the time server at the given address
void sendNTPpacket(IPAddress &address)
{
  // set all bytes in the buffer to 0
  memset(packetBuffer, 0, NTP_PACKET_SIZE);
  // Initialize values needed to form NTP request
  // (see URL above for details on the packets)
  packetBuffer[0] = 0b11100011; // LI, Version, Mode
  packetBuffer[1] = 0;          // Stratum, or type of clock
  packetBuffer[2] = 6;          // Polling Interval
  packetBuffer[3] = 0xEC;       // Peer Clock Precision
  // 8 bytes of zero for Root Delay & Root Dispersion
  packetBuffer[12] = 49;
  packetBuffer[13] = 0x4E;
  packetBuffer[14] = 49;
  packetBuffer[15] = 52;
  // all NTP fields have been given values, now
  // you can send a packet requesting a timestamp:
  UDP.beginPacket(address, 123); // NTP requests are to port 123
  UDP.write(packetBuffer, NTP_PACKET_SIZE);
  UDP.endPacket();
}

//===============================================================================================================================================
//===============================================================================================================================================

void setup()
{
  delay(1000);
  Serial.begin(9600);
  // ---------------- EEPROM (FLASH MEMORY) ----------
  EEPROM.begin(260);
  //----------------------------------------
  pinMode(PtoBuzzer, OUTPUT); // BUZZER
  delay(2);
  digitalWrite(PtoBuzzer, LOW);
  //-------------------------------------- SENSORES
  pinMode(Sensor_1, INPUT); // sets the digital pin as Input
  // attachInterrupt(digitalPinToInterrupt(Sensor_1), in_people, RISING);

  pinMode(Sensor_2, INPUT); // sets the digital pin as Input
  // attachInterrupt(digitalPinToInterrupt(Sensor_2), out_people, RISING);
  //-------------- WIFI -----------------
  ConnectWiFi_STA();

  // -------------- FIREBASE -------------------------
  Serial.printf("Firebase Client v%s\n\n", FIREBASE_CLIENT_VERSION);

  /* Assign the api key (required) */
  config.api_key = API_KEY;

  /* Assign the user sign in credentials */
  auth.user.email = USER_EMAIL;
  auth.user.password = USER_PASSWORD;

  /* Assign the RTDB URL (required) */
  config.database_url = DATABASE_URL;

  /* Assign the callback function for the long running token generation task */
  config.token_status_callback = tokenStatusCallback; // see addons/TokenHelper.h

  // Or use legacy authenticate method
  // config.database_url = DATABASE_URL;
  // config.signer.tokens.legacy_token = "<database secret>";

  Firebase.begin(&config, &auth);

  // Comment or pass false value when WiFi reconnection will control by your code or third party library
  Firebase.reconnectWiFi(true);

  // Optional, use classic HTTP GET and POST requests.
  // This option allows get and delete functions (PUT and DELETE HTTP requests) works for
  // device connected behind the Firewall that allows only GET and POST requests.
  Firebase.RTDB.enableClassicRequest(&fbdo, true);

  /// ------ EPROM INIT ----
  // condicional puesto para validar que los datos esten escritos en firebase
  if (Firebase.ready())
  {
    if (String("null") == String(Firebase.RTDB.getString(&fbdo, path_config + "/" + "wifi" + "/" + "ssid" + "/") ? fbdo.to<const char *>() : fbdo.errorReason().c_str()))
    {
      Serial.println(">>> Estableciendo datos por defecto en Firebase");
      jsonConfigDataSetFirstStart(); // si  no estan escritos primero crea los datos en la nube
      Serial.println("<<< Grabando datos en memoria");
      setCofigEprom();     // luego los lee y guarda en eeprom
    }
    else
    {
      Serial.println("<<< Lectura de Data en Firebase y guardado en la EEPROM");
      setCofigEprom();     // si ya existen los datos, primero lee y guarda el la eeprom
      jsonConfigDataSet(); // escribe los datos los nuevos datos en la nuebe
    }
  }
  else
  {
    setCofigEprom(); // si firebase no se establece solo se configura
  }

  /// ---- SETEO DE CONFIGURACIÓN INICIAL  ----
  BDatos.aforo = readStringFromEEPROM(190).toInt();
  horas_inactividad_max = readStringFromEEPROM(230).toFloat();

  localPort = readStringFromEEPROM(150).toInt();
  remotePort = readStringFromEEPROM(160).toInt();
  remotePortDashboard = readStringFromEEPROM(170).toInt();

  remoteIP_dashboard[0] = WiFi.localIP()[0];
  remoteIP_dashboard[1] = WiFi.localIP()[1];
  remoteIP_dashboard[2] = WiFi.localIP()[2];
  remoteIP_dashboard[3] = readStringFromEEPROM(180).toInt();

  /// ---- UDP INIT -----
  ConnectUDP();
  //--------------- CLOCK NTP SERVER ----------------
  setSyncProvider(getNtpTime);
  setSyncInterval(300);
}

int inicio_r = 0;
unsigned int refresh = 0; // variable para enviar datos cada 2 segundos, sistema de defensa frente a perdida de datos udp

void loop()
{
  reinicio_de_cuenta(); // reinicio a 0 de ingresos, egresos y total cuando ocurre un nuevo día.
  envioDataRealtime();  // envio de data realtime
  actualizarConfigFlash();
  GetUDP_Packet(false); // esperar a que llegen paquetes

  time_millis = millis();
  if (time_millis < 500)
  {                         // cuando millis desb orde despues de 50d aprox.
    before_time_millis = 0; // volvemos el tiempo_aux a 0;
  }

