cangalaya/control-aforo-esp8266/src/main.cpp
  if (before_time_millis != time_millis)
  {
    before_time_millis = time_millis;
    counter_millis++;
    // Serial.println("Segundos transcurridos: " + String(counter_millis));
  }
  if (counter_millis >= (3600000 * horas_inactividad_max))
  { //(60000*horas_inactividad_max)    60000 = 1min    1hora(60min)= 3600000
    BDatos.total = 0;
    counter_millis = 0;
    Serial.println("Reseteo del total por tiempo de innactividad");
  }

  if (inicio_r == 0) // condicional puesta el setear datos cuando cualquiera de las 2 puertas se apaga repentinamente
  {
    inicio_r = 1;
    // actualizar_pantalla();
    mandar_data_display(); //<<<<<<<<
    // BDatos.estado_inicial = 1;                      //salimos del estado incial
    SendUDP_Packet(String() + BDatos.estado_inicial + '|' + BDatos.aforo + '|' + BDatos.total + '|' + BDatos.ingresos + '|' + BDatos.egresos);
    BDatos.estado_inicial = 1; // salimos del estado incial
  }

  if (flag_send_data == 1) // condicional para enviar datos iniciales
  {
    flag_send_data = 0;
    SendUDP_Packet(String() + BDatos.estado_inicial + '|' + BDatos.aforo + '|' + BDatos.total + '|' + BDatos.ingresos + '|' + BDatos.egresos);
    ////////////////////////////// ENVIO DE DATOS AL DASHBOARD //////////////////////////////
    SendUDP_Packet_Dashboard(String() + BDatos.aforo + '|' + BDatos.total + '|' + BDatos.ingresos + '|' + BDatos.egresos);
    mandar_data_display(); //<<<<<<<<
    Serial.println("Datos Enviados");
  }

  // ESCRIBIR EN DATABASE FIRESTORE
  // if ((Firebase.ready() && (millis() - PrevMillis > 5000)) || PrevMillis == 0)
  // {
  //   PrevMillis = millis();
  //   String timeStamp = String(String(year()) + "-" + String(month()) + "-" + String(day()) + "--" + String(hour()) + "-" + String(minute()));
  //   Serial.println(timeStamp);

  //   documentPath = "tasa/pisco-sur/comedor-secundario/" + timeStamp;

  //   // If the document path contains space e.g. "a b c/d e f"
  //   // It should encode the space as %20 then the path will be "a%20b%20c/d%20e%20f"

  //   content.clear();
  //   content.set("fields/aforo/integerValue", String(BDatos.aforo).c_str());
  //   content.set("fields/total/integerValue", String(BDatos.total).c_str());
  //   content.set("fields/egresos/integerValue", String(BDatos.egresos).c_str());
  //   content.set("fields/ingresos/integerValue", String(BDatos.ingresos).c_str());
  //   //content.set("fields/excesos/integerValue", String(random(1, 20)).c_str());

  //   Serial.print("Create a document... ");

  //   if (Firebase.Firestore.createDocument(&fbdo, FIREBASE_PROJECT_ID, "" /* databaseId can be (default) or empty */, documentPath.c_str(), content.raw()))
  //     Serial.printf("ok\n%s\n\n", fbdo.payload().c_str());
  //   else
  //     Serial.println(fbdo.errorReason());
  // }

  //// OBTENCION DE VALORES INT DE REALTIME FIREBASE EJECUTAR EN INTERVALOS DE HORAS
  // if ((Firebase.ready() && (millis() - PrevMillis > 5000) || PrevMillis == 0))
  // {
  //   PrevMillis = millis();
  //   int integer = 0;
  //   Firebase.RTDB.getInt(&fbdo, "/tasa/callao/bano-varones/config/aforo") ? integer = fbdo.to<int>() : Serial.print(fbdo.errorReason().c_str());
  //   Serial.println(integer);
  // }
  if (counter_millis >= readStringFromEEPROM(210).toInt()) // seteo de tiempo de espera para iniciar otro conteo
    censusPeople();
  // Sesado de personas saliendo o ingresado. Actualiza BDatos.local y lo envia al otro esp
  refresh++;
  if (refresh == 65000)
  {
    refresh = 0;
    flag_send_data = 1;
  }
}